Миша заполнял таблицу истинности логической функции $F = (x \lor y) \land \neg (y \equiv z) \land \neg w$ , но успел заполнить лишь фрагмент из трёх различных её строк, даже не указав, какому столбцу таблицы соответствует каждая из переменных w,x,y,zw,x,y,z.

|     |     |     |     | **F** |
| :-: | :-: | :-: | :-: | :---: |
|  1  |     |  1  |     | **1** |
|  0  |  1  |     |  0  | **1** |
|     |  1  |  1  |  0  | **1** |

Определите, какому столбцу таблицы соответствует каждая из переменных w,x,y,zw,x,y,z.  
В ответе напишите буквы w,x,y,zw,x,y,z в том порядке, в котором идут соответствующие им столбцы (сначала буква, соответствующая первому столбцу; затем буква, соответствующая второму столбцу, и т.д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.

## Решение:

Задачу можно решить в два этапа:
1. Написать код на ЯП (в моем случае на Python)
2. Подставить  полученные значения в таблицу, согласно условию задачи и их порядку.

### Код

```python
for x in [0,1]:
    for y in [0,1]:
        for z in [0,1]:
            for w in [0,1]:
                if ((x or y) and not(y == z) and not w) == 1:
                    print(x, y, z, w)
```

#for
Данный код позволяет решить указанную задачу и схожие по типу. Работает по принципу перебора всех возможных значений для указанных переменных в логическом выражении. Так, сначала x = 0, y = 0, w = 0, z = 0. Затем значение $z$ при итерации цикла увеличивается на 1. Затем для остальных значений происходит тоже самое. При этом, когда значение верхнего цикла (родительского) увеличивается на один, весь код внутри повторяется, т.е. вложенные (дочерние) циклы будут воспроизводиться заново.

Когда логическое выражение при подстановке значений переменных будет возвращать нужное логическое значение (истина, в нашем случае), мы выведем значение этих переменных на экран.

### Подстановка значений

Полученные в результате работы программы значения можно логически расставить по своим местам в таблице, опираясь на количество 0 и 1 в столбцах, а также опираясь на значения переменных в строках.

```
0 1 0 0
1 0 1 0
1 1 0 0
```